In [1]:
#Creating Databases in MySQL
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="#meKRISH30"
)

print(mydb)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000001A3C8429280>

In [2]:
#cursor for running the MySQL in Python Jupyter Notebook

cursor = mydb.cursor()

In [3]:
#

cursor.execute('SHOW DATABASES')

for database in cursor:
    print(database)

('abc',)
('business',)
('cantilever',)
('games2win',)
('grofers',)
('information_schema',)
('krish',)
('mysql',)
('performance_schema',)
('pharm_easy',)
('sales',)
('sys',)

In [4]:
# use database

cursor.execute('USE grofers')

In [5]:
# sql_mode=only_full_group_by

sql= "SET sql_mode=(SELECT REPLACE(@@sql_mode,'ONLY_FULL_GROUP_BY',''))"
cursor.execute(sql)
mydb.commit()

### DATE 

### TIME

In [6]:
# DATE-
# TIME-

sql= "select date(DateTime), time(DateTime) from table2"  
cursor.execute(sql)
myresult= cursor.fetchall() 
for x in myresult:
  print(x)

(datetime.date(2020, 2, 1), datetime.timedelta(seconds=73220))
(datetime.date(2020, 2, 2), datetime.timedelta(seconds=27630))
(datetime.date(2020, 2, 3), datetime.timedelta(seconds=43850))
(datetime.date(2020, 2, 4), datetime.timedelta(seconds=39042))
(datetime.date(2020, 2, 5), datetime.timedelta(seconds=63040))
(datetime.date(2020, 2, 6), datetime.timedelta(seconds=70006))
(datetime.date(2020, 2, 7), datetime.timedelta(seconds=56216))
(datetime.date(2020, 2, 8), datetime.timedelta(seconds=19806))
(None, None)

### YEAR()- 
* Returns the year for a given date.

### MONTH()- 
* Returns the month for a given date.(1-12)

### DAY()- 
* Returns the day for a given date.(1-31)

In [7]:
# YEAR()- returns the year for a given date.
# MONTH()- returns the month for a given date.(1-12)
# DAY()- returns the day for a given date.(1-31)

sql= "select ID, year(Date), MONTH(DateTime), DAY(DateTime) from table2"  
cursor.execute(sql)
myresult= cursor.fetchall() 

for x in myresult:
  print(x)

('1', 2018, 2, 1)
('2', 2018, 2, 2)
('3', 2018, 2, 3)
('4', 2018, 2, 4)
('5', 2018, 2, 5)
('6', 2018, 2, 6)
('7', 2018, 2, 7)
('8', 2019, 2, 8)
('9', 2020, None, None)

### HOUR()- 
* Returns the hour of a time.

### MINUTE()- 
* Returns the minute of a time.

### SECOND()- 
* Returns the second of a time.

In [8]:
# HOUR()- returns the hour of a time.
# MINUTE()- returns the minute of a time.
# SECOND()- returns the second of a time.

sql= "select ID, HOUR(DateTime), MINUTE(DateTime), SECOND(DateTime) from table2"  
cursor.execute(sql)
myresult= cursor.fetchall() 

for x in myresult:
  print(x)

('1', 20, 20, 20)
('2', 7, 40, 30)
('3', 12, 10, 50)
('4', 10, 50, 42)
('5', 17, 30, 40)
('6', 19, 26, 46)
('7', 15, 36, 56)
('8', 5, 30, 6)
('9', None, None, None)

### DAYNAME()-
* Returns the name of the week day of a date specified in the argument.

### MONTHNAME()-
* Returns the name of the month

In [9]:
# DAYNAME()-returns the name of the week day of a date specified in the argument.
# MONTHNAME()-Returns the name of the month
#

sql= "select ID, monthname(Date), dayname(DateTime) from table2"  
cursor.execute(sql)
myresult= cursor.fetchall() 

for x in myresult:
  print(x)

('1', 'March', 'Saturday')
('2', 'May', 'Sunday')
('3', 'June', 'Monday')
('4', 'July', 'Tuesday')
('5', 'August', 'Wednesday')
('6', 'September', 'Thursday')
('7', 'November', 'Friday')
('8', 'October', 'Saturday')
('9', 'July', None)

# DAY OF YEAR()-
# DAY OF MONTH()-
# DAY OF WEEK()-

In [10]:
# DAY OF YEAR()-
# DAY OF MONTH()-
# DAY OF WEEK()- 

sql= "select dayofyear(DateTime), DAYOFMONTH(Date), DAYOFWEEK(Date) from table2;"  
cursor.execute(sql)
myresult= cursor.fetchall() 

for x in myresult:
  print(x)

(32, 1, 5)
(33, 3, 5)
(34, 4, 2)
(35, 5, 5)
(36, 6, 2)
(37, 7, 6)
(38, 15, 5)
(39, 24, 5)
(None, 1, 4)

# LAST_DAY()

In [11]:
# LAST_DAY()
#

sql= "select last_day(Date) from table2;"  
cursor.execute(sql)
myresult= cursor.fetchall() 

for x in myresult:
  print(x)

(datetime.date(2018, 3, 31),)
(datetime.date(2018, 5, 31),)
(datetime.date(2018, 6, 30),)
(datetime.date(2018, 7, 31),)
(datetime.date(2018, 8, 31),)
(datetime.date(2018, 9, 30),)
(datetime.date(2018, 11, 30),)
(datetime.date(2019, 10, 31),)
(datetime.date(2020, 7, 31),)

# DATEDIFF(Exp1,Exp2)- Subtract two dates and returns in days
* DATEDIFF('2020-03-10','2020-03-08') --> (2)

# TIMEDIFF(Exp1,Exp2)- Subtract two times and returns in hours
* TIMEDIFF('20:30','18:20') -->(02:10)

In [12]:
# DATEDIFF(Exp1,Exp2)- Subtract two dates and returns in days
# DATEDIFF('2020-03-10','2020-03-08') --> (2)

sql= "select datediff(now(),DateTime) from table2"  
cursor.execute(sql)
myresult= cursor.fetchall() 

for x in myresult:
  print(x)

(450,)
(449,)
(448,)
(447,)
(446,)
(445,)
(444,)
(443,)
(None,)

In [13]:
# TIMEDIFF(Exp1,Exp2)- Subtract two times and returns in hours
# TIMEDIFF('20:30','18:20') -->(02:10)

sql= "select TIMEDIFF('20:30','18:20')"  
cursor.execute(sql)
myresult= cursor.fetchall() 

for x in myresult:
  print(x)

(datetime.timedelta(seconds=7800),)

### The STR_TO_DATE() returns a date based on a string and a format.

* STR_TO_DATE(string, format)
* * string	Required. The string to be formatted to a date
* * format	Required. The format to use. Can be one or a combination of the following values:
* -
* %a	Abbreviated weekday name (Sun to Sat)
* %b	Abbreviated month name (Jan to Dec)
* %c	Numeric month name (0 to 12)
* %D	Day of the month as a numeric value, followed by suffix (1st, 2nd, 3rd, ...)
* %d	Day of the month as a numeric value (01 to 31)
* %e	Day of the month as a numeric value (0 to 31)
* %f	Microseconds (000000 to 999999)
* %H	Hour (00 to 23)
* %h	Hour (00 to 12)
* %I	Hour (00 to 12)
* %i	Minutes (00 to 59)
* %j	Day of the year (001 to 366)
* %k	Hour (0 to 23)
* %l	Hour (1 to 12)
* %M	Month name in full (January to December)
* %m	Month name as a numeric value (01 to 12)
* %p	AM or PM
* %r	Time in 12 hour AM or PM format (hh:mm:ss AM/PM)
* %S	Seconds (00 to 59)
* %s	Seconds (00 to 59)
* %T	Time in 24 hour format (hh:mm:ss)
* %U	Week where Sunday is the first day of the week (00 to 53)
* %u	Week where Monday is the first day of the week (00 to 53)
* %V	Week where Sunday is the first day of the week (01 to 53). Used with %X
* %v	Week where Monday is the first day of the week (01 to 53). Used with %X
* %W	Weekday name in full (Sunday to Saturday)
* %w	Day of the week where Sunday=0 and Saturday=6
* %X	Year for the week where Sunday is the first day of the week. Used with %V
* %x	Year for the week where Monday is the first day of the week. Used with %V
* %Y	Year as a numeric, 4-digit value
* %y	Year as a numeric, 2-digit value

In [14]:
# Change PM ino 24 hours

# STR_TO_DATE() returns a date based on a string and a format.
# STR_TO_DATE('08:35 PM', '%l:%i %p') -->(20:35:00)

sql= "SELECT STR_TO_DATE('08:35 PM', '%l:%i %p');"  
cursor.execute(sql)
myresult= cursor.fetchall() 

for x in myresult:
  print(x)

(datetime.timedelta(seconds=74100),)

### DATE_FORMAT("2017-06-15", "%Y")

Format	Description
* %D	Day of the month as a numeric value, followed by suffix (1st, 2nd, 3rd, ...)
* %d	Day of the month as a numeric value (01 to 31)
* %e	Day of the month as a numeric value (0 to 31)
* %j	Day of the year (001 to 366)
* -
* %b	Abbreviated month name (Jan to Dec)
* %c	Numeric month name (0 to 12)
* %M	Month name in full (January to December)
* %m	Month name as a numeric value (00 to 12)
* -
* %Y	Year as a numeric, 4-digit value
* %y	Year as a numeric, 2-digit value
* -
* %a	Abbreviated weekday name (Sun to Sat)
* %f	Microseconds (000000 to 999999)
* %H	Hour (00 to 23)
* %h	Hour (00 to 12)
* %I	Hour (00 to 12)
* %i	Minutes (00 to 59)
* %k	Hour (0 to 23)
* %l	Hour (1 to 12)
* %p	AM or PM
* %r	Time in 12 hour AM or PM format (hh:mm:ss AM/PM)
* %S	Seconds (00 to 59)
* %s	Seconds (00 to 59)
* %T	Time in 24 hour format (hh:mm:ss)
* %U	Week where Sunday is the first day of the week (00 to 53)
* %u	Week where Monday is the first day of the week (00 to 53)
* %V	Week where Sunday is the first day of the week (01 to 53). Used with %X
* %v	Week where Monday is the first day of the week (01 to 53). Used with %x
* %W	Weekday name in full (Sunday to Saturday)
* %w	Day of the week where Sunday=0 and Saturday=6
* %X	Year for the week where Sunday is the first day of the week. Used with %V
* %x	Year for the week where Monday is the first day of the week. Used with %v

In [15]:
# 
#
"""
sql= "select DATE_FORMAT(Date,"%Y") from table2"  
cursor.execute(sql)
myresult= cursor.fetchall() 

for x in myresult:
  print(x)
"""

'\nsql= "select DATE_FORMAT(Date,"%Y") from table2"  \ncursor.execute(sql)\nmyresult= cursor.fetchall() \n\nfor x in myresult:\n  print(x)\n'

## The EXTRACT()- function extracts a part from a given date.

Syntax
* EXTRACT(part FROM date)
###### Required. The part to extract. Can be one of the following:
* MICROSECOND
* SECOND
* MINUTE
* HOUR
* DAY
* WEEK
* MONTH
* QUARTER
* YEAR
* SECOND_MICROSECOND
* MINUTE_MICROSECOND
* MINUTE_SECOND
* HOUR_MICROSECOND
* HOUR_SECOND
* HOUR_MINUTE
* DAY_MICROSECOND
* DAY_SECOND
* DAY_MINUTE
* DAY_HOUR
* YEAR_MONTH

In [16]:
# 
#

sql= ""  
cursor.execute(sql)
myresult= cursor.fetchall() 

for x in myresult:
  print(x)

In [17]:
# 
#

sql= ""  
cursor.execute(sql)
myresult= cursor.fetchall() 

for x in myresult:
  print(x)

In [18]:
# MAKEDATE(YEAR, YEARDAY)____MAKEDATE(2017, 175)--> 2017-06-24
#
"""
sql= ""  
cursor.execute(sql)
myresult= cursor.fetchall() 

for x in myresult:
  print(x)
"""

'\nsql= ""  \ncursor.execute(sql)\nmyresult= cursor.fetchall() \n\nfor x in myresult:\n  print(x)\n'

In [19]:
# 
# 

sql= ""  
cursor.execute(sql)
myresult= cursor.fetchall() 

for x in myresult:
  print(x)